In [ ]:
# set and reset _index
# inbuilt functions like iter.., max,mean etc

In [1]:
import pandas as pd

In [2]:
data = {
    "a": [9,2,3,4],
    "b": ["shri","kuresh","embar","dashrathi"],
    "c": [7,8,9,0]
}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

   a          b  c
0  9       shri  7
1  2     kuresh  8
2  3      embar  9
3  4  dashrathi  0

In [5]:
df.set_index('a',inplace=True)

In [6]:
df

           b  c
a
9       shri  7
2     kuresh  8
3      embar  9
4  dashrathi  0

In [7]:
df.reset_index(inplace=True)

In [8]:
df

   a          b  c
0  9       shri  7
1  2     kuresh  8
2  3      embar  9
3  4  dashrathi  0

In [9]:
data = {
    "a": [9,2,3,4],
    "b": ["shri","kuresh","embar","dashrathi"],
    "c": [7,8,9,0]
}
df1 = pd.DataFrame(data,index=['b','c','d','e'])

In [10]:
df1

   a          b  c
b  9       shri  7
c  2     kuresh  8
d  3      embar  9
e  4  dashrathi  0

In [11]:
df1.reindex(['e','d','b','c'])

   a          b  c
e  4  dashrathi  0
d  3      embar  9
b  9       shri  7
c  2     kuresh  8

In [12]:
df1

   a          b  c
b  9       shri  7
c  2     kuresh  8
d  3      embar  9
e  4  dashrathi  0

In [13]:
for i,j in df1.iterrows():
    print(i,j)   #i is index

b a       9
b    shri
c       7
Name: b, dtype: object
c a         2
b    kuresh
c         8
Name: c, dtype: object
d a        3
b    embar
c        9
Name: d, dtype: object
e a            4
b    dashrathi
c            0
Name: e, dtype: object

In [14]:
for col_name,rowName_values in df1.iteritems():
    print(col_name,rowName_values)

a b    9
c    2
d    3
e    4
Name: a, dtype: int64
b b         shri
c       kuresh
d        embar
e    dashrathi
Name: b, dtype: object
c b    7
c    8
d    9
e    0
Name: c, dtype: int64

/tmp/ipykernel_586/1429448653.py:1: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  for col_name,rowName_values in df1.iteritems():

In [15]:
df1

   a          b  c
b  9       shri  7
c  2     kuresh  8
d  3      embar  9
e  4  dashrathi  0

In [16]:
df1['a']

b    9
c    2
d    3
e    4
Name: a, dtype: int64

In [17]:
list(df1['a'])

[9, 2, 3, 4]

In [18]:
[i for i in df1['a']]

[9, 2, 3, 4]

In [19]:
df1

   a          b  c
b  9       shri  7
c  2     kuresh  8
d  3      embar  9
e  4  dashrathi  0

In [20]:
def test(x):
    return x.sum()
df1.apply(test)

a                          18
b    shrikureshembardashrathi
c                          24
dtype: object

In [21]:
# give error

# def test(x):
#     return x.sum()
# df1.apply(test,axis=1)

In [22]:
df2 = df1[['a','c']]

In [23]:
df2

   a  c
b  9  7
c  2  8
d  3  9
e  4  0

In [24]:
# squaring whole values
df2.applymap(lambda x: x**2 )

    a   c
b  81  49
c   4  64
d   9  81
e  16   0

In [25]:
df1

   a          b  c
b  9       shri  7
c  2     kuresh  8
d  3      embar  9
e  4  dashrathi  0

In [26]:
#sort values
df1.sort_values('b')

   a          b  c
e  4  dashrathi  0
d  3      embar  9
c  2     kuresh  8
b  9       shri  7

In [27]:
#sort index in descending order
df1.sort_index(ascending = False)

   a          b  c
e  4  dashrathi  0
d  3      embar  9
c  2     kuresh  8
b  9       shri  7

In [28]:
df1

   a          b  c
b  9       shri  7
c  2     kuresh  8
d  3      embar  9
e  4  dashrathi  0

In [33]:
df1['a'].mean()

4.5

In [34]:
df1['a'].mode()

0    2
1    3
2    4
3    9
Name: a, dtype: int64

In [35]:
df1['a'].median()

3.5

In [36]:
df1['a'].std()

3.1091263510296048

In [37]:
df1['a'].var()

9.666666666666666